In [112]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Series

In [2]:
s = Series(np.random.rand(10))

In [3]:
s

0    0.671980
1    0.044494
2    0.044855
3    0.999735
4    0.528278
5    0.690280
6    0.125535
7    0.992217
8    0.308162
9    0.901632
dtype: float64

In [4]:
s.sort_values()

1    0.044494
2    0.044855
6    0.125535
8    0.308162
4    0.528278
0    0.671980
5    0.690280
9    0.901632
7    0.992217
3    0.999735
dtype: float64

In [5]:
s.sort_values(ascending=False)

3    0.999735
7    0.992217
9    0.901632
5    0.690280
0    0.671980
4    0.528278
8    0.308162
6    0.125535
2    0.044855
1    0.044494
dtype: float64

In [6]:
s.sort_index(ascending=False)

9    0.901632
8    0.308162
7    0.992217
6    0.125535
5    0.690280
4    0.528278
3    0.999735
2    0.044855
1    0.044494
0    0.671980
dtype: float64

In [7]:
s.min()

0.04449366055661397

In [8]:
s.mean()

0.5307169563855694

In [9]:
s1 = Series([1,2,3])
s2 = Series([4,5,6])

In [10]:
s1 + s2

0    5
1    7
2    9
dtype: int64

In [11]:
s1 = Series([1,2,3], index =['A', 'B', 'C'])
s2 = Series([4,5,6], index =['A', 'D', 'E'])

In [12]:
s1 + s2

A    5.0
B    NaN
C    NaN
D    NaN
E    NaN
dtype: float64

# DataFrame

In [13]:
df = DataFrame(np.random.rand(20).reshape([4,5]))

In [14]:
df

          0         1         2         3         4
0  0.023946  0.250010  0.839477  0.156526  0.310718
1  0.433673  0.730576  0.768778  0.411618  0.502181
2  0.719501  0.528370  0.171777  0.333673  0.198688
3  0.309676  0.953542  0.735675  0.937426  0.740579

In [15]:
df.sort_values(by = 4, ascending = False)

          0         1         2         3         4
3  0.309676  0.953542  0.735675  0.937426  0.740579
1  0.433673  0.730576  0.768778  0.411618  0.502181
0  0.023946  0.250010  0.839477  0.156526  0.310718
2  0.719501  0.528370  0.171777  0.333673  0.198688

In [16]:
df.sort_values(axis = 1, by =3)

          0         2         4         3         1
0  0.023946  0.839477  0.310718  0.156526  0.250010
1  0.433673  0.768778  0.502181  0.411618  0.730576
2  0.719501  0.171777  0.198688  0.333673  0.528370
3  0.309676  0.735675  0.740579  0.937426  0.953542

In [17]:
df.sort_index()

          0         1         2         3         4
0  0.023946  0.250010  0.839477  0.156526  0.310718
1  0.433673  0.730576  0.768778  0.411618  0.502181
2  0.719501  0.528370  0.171777  0.333673  0.198688
3  0.309676  0.953542  0.735675  0.937426  0.740579

In [18]:
df.max()

0    0.719501
1    0.953542
2    0.839477
3    0.937426
4    0.740579
dtype: float64

In [19]:
df.max(axis=1)

0    0.839477
1    0.768778
2    0.719501
3    0.953542
dtype: float64

In [20]:
df.describe()

              0         1         2         3         4
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.371699  0.615625  0.628927  0.459811  0.438042
std    0.288436  0.299271  0.307826  0.335823  0.237448
min    0.023946  0.250010  0.171777  0.156526  0.198688
25%    0.238243  0.458780  0.594700  0.289386  0.282711
50%    0.371675  0.629473  0.752226  0.372645  0.406449
75%    0.505130  0.786318  0.786453  0.543070  0.561780
max    0.719501  0.953542  0.839477  0.937426  0.740579

# binning

In [21]:
score_list = np.random.randint(30, 100 ,20)

In [22]:
score_list

array([67, 93, 88, 86, 40, 38, 51, 74, 72, 83, 71, 79, 41, 32, 55, 39, 71,
       98, 86, 86])

In [23]:
bins =[30, 59, 79, 100]

In [24]:
a = pd.cut(score_list,bins)

In [25]:
a

[(59, 79], (79, 100], (79, 100], (79, 100], (30, 59], ..., (30, 59], (59, 79], (79, 100], (79, 100], (79, 100]]
Length: 20
Categories (3, interval[int64]): [(30, 59] < (59, 79] < (79, 100]]

In [26]:
type(a)

pandas.core.arrays.categorical.Categorical

In [27]:
a.value_counts()

(30, 59]     7
(59, 79]     6
(79, 100]    7
dtype: int64

In [28]:
from pandas._testing import rands_array

In [29]:
df = DataFrame()

In [30]:
df['student'] = rands_array(5,20)

In [31]:
df

   student
0    TXyuR
1    WLvoO
2    h6MlS
3    y9NK5
4    ADm1d
5    ZywWU
6    XlLXI
7    kht2B
8    lSlv8
9    tXR2P
10   xqQer
11   de6WY
12   YQ0F7
13   if5Ca
14   5GZdL
15   3ZFCI
16   5i7kA
17   08XHM
18   i1kK6
19   W2TeU

In [32]:
df['score'] = score_list

In [33]:
df

   student  score
0    TXyuR     67
1    WLvoO     93
2    h6MlS     88
3    y9NK5     86
4    ADm1d     40
5    ZywWU     38
6    XlLXI     51
7    kht2B     74
8    lSlv8     72
9    tXR2P     83
10   xqQer     71
11   de6WY     79
12   YQ0F7     41
13   if5Ca     32
14   5GZdL     55
15   3ZFCI     39
16   5i7kA     71
17   08XHM     98
18   i1kK6     86
19   W2TeU     86

In [34]:
pd.cut(df['score'],bins, labels = ['bad','okay','great'])

0      okay
1     great
2     great
3     great
4       bad
5       bad
6       bad
7      okay
8      okay
9     great
10     okay
11     okay
12      bad
13      bad
14      bad
15      bad
16     okay
17    great
18    great
19    great
Name: score, dtype: category
Categories (3, object): [bad < okay < great]

In [35]:
pd.cut(df['score'],bins, labels = ['bad','okay','great'])

0      okay
1     great
2     great
3     great
4       bad
5       bad
6       bad
7      okay
8      okay
9     great
10     okay
11     okay
12      bad
13      bad
14      bad
15      bad
16     okay
17    great
18    great
19    great
Name: score, dtype: category
Categories (3, object): [bad < okay < great]

In [36]:
df['bins'] =pd.cut(df['score'],bins, labels = ['bad','okay','great'])

In [37]:
df

   student  score   bins
0    TXyuR     67   okay
1    WLvoO     93  great
2    h6MlS     88  great
3    y9NK5     86  great
4    ADm1d     40    bad
5    ZywWU     38    bad
6    XlLXI     51    bad
7    kht2B     74   okay
8    lSlv8     72   okay
9    tXR2P     83  great
10   xqQer     71   okay
11   de6WY     79   okay
12   YQ0F7     41    bad
13   if5Ca     32    bad
14   5GZdL     55    bad
15   3ZFCI     39    bad
16   5i7kA     71   okay
17   08XHM     98  great
18   i1kK6     86  great
19   W2TeU     86  great

# Group by

In [38]:
ls ../bananaiselite/

AMZN.csv                               Public/
Anaconda/                              PycharmProjects/
Applications/                          VirtualBox VMs/
BABA.csv                               apply_demo.csv
Basic Pandas.ipynb                     bin/
DataFrame - Selecting and Index.ipynb  city_weather.csv
Desktop/                               demo_duplicate.csv
Documents/                             eclipse/
Downloads/                             eclipse-workspace/
Library/                               iris.csv
MEGA/                                  movie_metadata.csv*
MEGAsync Downloads/                    opt/
Movies/                                sales-funnel.xlsx
Music/                                 top5.csv
Parallels/                             train.csv
Pictures/                              usa_flights.csv
Pokemon.csv*

In [39]:
df= pd.read_csv('../bananaiselite/city_weather.csv')

In [40]:
df

          date city  temperature  wind
0   03/01/2016   BJ            8     5
1   17/01/2016   BJ           12     2
2   31/01/2016   BJ           19     2
3   14/02/2016   BJ           -3     3
4   28/02/2016   BJ           19     2
5   13/03/2016   BJ            5     3
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4

In [41]:
df.groupby(df['city'])

In [42]:
g = df.groupby(df['city'])

In [43]:
g.groups

{'BJ': Int64Index([0, 1, 2, 3, 4, 5], dtype='int64'),
 'GZ': Int64Index([14, 15, 16, 17], dtype='int64'),
 'SH': Int64Index([6, 7, 8, 9, 10, 11, 12, 13], dtype='int64'),
 'SZ': Int64Index([18, 19], dtype='int64')}

In [44]:
g.groups['BJ']

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [45]:
g.get_group('BJ')

         date city  temperature  wind
0  03/01/2016   BJ            8     5
1  17/01/2016   BJ           12     2
2  31/01/2016   BJ           19     2
3  14/02/2016   BJ           -3     3
4  28/02/2016   BJ           19     2
5  13/03/2016   BJ            5     3

In [46]:
g.get_group('SH')

          date city  temperature  wind
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5

In [47]:
g.get_group('SH').max()

date           27/03/2016
city                   SH
temperature            20
wind                    5
dtype: object

In [48]:
g.get_group('SH').mean()

temperature    4.625
wind           3.625
dtype: float64

In [49]:
g.max()

            date  temperature  wind
city
BJ    31/01/2016           19     5
GZ    31/07/2016           25     5
SH    27/03/2016           20     5
SZ    25/09/2016           20     4

In [50]:
for group_name,group_value in g:
    print(group_name)
    print(group_value)

BJ
         date city  temperature  wind
0  03/01/2016   BJ            8     5
1  17/01/2016   BJ           12     2
2  31/01/2016   BJ           19     2
3  14/02/2016   BJ           -3     3
4  28/02/2016   BJ           19     2
5  13/03/2016   BJ            5     3
GZ
          date city  temperature  wind
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
SH
          date city  temperature  wind
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
SZ
          date city  temperature  wind
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4

# Aggregatoin

In [51]:
df

          date city  temperature  wind
0   03/01/2016   BJ            8     5
1   17/01/2016   BJ           12     2
2   31/01/2016   BJ           19     2
3   14/02/2016   BJ           -3     3
4   28/02/2016   BJ           19     2
5   13/03/2016   BJ            5     3
6   27/03/2016   SH           -4     4
7   10/04/2016   SH           19     3
8   24/04/2016   SH           20     3
9   08/05/2016   SH           17     3
10  22/05/2016   SH            4     2
11  05/06/2016   SH          -10     4
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
14  17/07/2016   GZ           10     2
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
17  28/08/2016   GZ           25     4
18  11/09/2016   SZ           20     1
19  25/09/2016   SZ          -10     4

In [52]:
g_new = df.groupby(['city','wind'])

In [53]:
g_new = df.groupby(['city','wind'])
g_new.groups

{('BJ', 2): Int64Index([1, 2, 4], dtype='int64'),
 ('BJ', 3): Int64Index([3, 5], dtype='int64'),
 ('BJ', 5): Int64Index([0], dtype='int64'),
 ('GZ', 2): Int64Index([14], dtype='int64'),
 ('GZ', 4): Int64Index([17], dtype='int64'),
 ('GZ', 5): Int64Index([15, 16], dtype='int64'),
 ('SH', 2): Int64Index([10], dtype='int64'),
 ('SH', 3): Int64Index([7, 8, 9], dtype='int64'),
 ('SH', 4): Int64Index([6, 11], dtype='int64'),
 ('SH', 5): Int64Index([12, 13], dtype='int64'),
 ('SZ', 1): Int64Index([18], dtype='int64'),
 ('SZ', 4): Int64Index([19], dtype='int64')}

In [54]:
g.get_group('BJ')

         date  temperature  wind
0  03/01/2016            8     5
1  17/01/2016           12     2
2  31/01/2016           19     2
3  14/02/2016           -3     3
4  28/02/2016           19     2
5  13/03/2016            5     3

In [55]:
g_new.get_group(('BJ',3))

         date city  temperature  wind
3  14/02/2016   BJ           -3     3
5  13/03/2016   BJ            5     3

In [56]:
for group_name,group_value in g_new:
    print(group_name)
    print(group_value)

('BJ', 2)
         date city  temperature  wind
1  17/01/2016   BJ           12     2
2  31/01/2016   BJ           19     2
4  28/02/2016   BJ           19     2
('BJ', 3)
         date city  temperature  wind
3  14/02/2016   BJ           -3     3
5  13/03/2016   BJ            5     3
('BJ', 5)
         date city  temperature  wind
0  03/01/2016   BJ            8     5
('GZ', 2)
          date city  temperature  wind
14  17/07/2016   GZ           10     2
('GZ', 4)
          date city  temperature  wind
17  28/08/2016   GZ           25     4
('GZ', 5)
          date city  temperature  wind
15  31/07/2016   GZ           -1     5
16  14/08/2016   GZ            1     5
('SH', 2)
          date city  temperature  wind
10  22/05/2016   SH            4     2
('SH', 3)
         date city  temperature  wind
7  10/04/2016   SH           19     3
8  24/04/2016   SH           20     3
9  08/05/2016   SH           17     3
('SH', 4)
          date city  temperature  wind
6   27/03/2016   SH           -4     4
11  05/06/2016   SH          -10     4
('SH', 5)
          date city  temperature  wind
12  19/06/2016   SH            0     5
13  03/07/2016   SH           -9     5
('SZ', 1)
          date city  temperature  wind
18  11/09/2016   SZ           20     1
('SZ', 4)
          date city  temperature  wind
19  25/09/2016   SZ          -10     4

In [57]:
g.agg('max')

            date  temperature  wind
city
BJ    31/01/2016           19     5
GZ    31/07/2016           25     5
SH    27/03/2016           20     5
SZ    25/09/2016           20     4

In [58]:
def foo(attr):
    return attr.max()-attr.min()

In [59]:
g.agg(foo)

      temperature  wind
city
BJ             22     3
GZ             26     3
SH             30     3
SZ             30     3

# Apply

In [61]:
ls ../bananaiselite/

AMZN.csv                               Public/
Anaconda/                              PycharmProjects/
Applications/                          VirtualBox VMs/
BABA.csv                               apply_demo.csv
Basic Pandas.ipynb                     bin/
DataFrame - Selecting and Index.ipynb  city_weather.csv
Desktop/                               demo_duplicate.csv
Documents/                             eclipse/
Downloads/                             eclipse-workspace/
Library/                               iris.csv
MEGA/                                  movie_metadata.csv*
MEGAsync Downloads/                    opt/
Movies/                                sales-funnel.xlsx
Music/                                 top5.csv
Parallels/                             train.csv
Pictures/                              usa_flights.csv
Pokemon.csv*

In [62]:
df = pd.read_csv('../bananaiselite/demo_duplicate.csv')

In [64]:
df.shape

(3989, 4)

In [66]:
df.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [67]:
df['A'] = Series(['a']*3989)

In [68]:
df.head()

    Price  Seqno Symbol        time  A
0  1623.0    0.0   APPL  1473411962  a
1  1623.0    0.0   APPL  1473411962  a
2  1623.0    0.0   APPL  1473411963  a
3  1623.0    0.0   APPL  1473411963  a
4  1649.0    1.0   APPL  1473411963  a

In [70]:
df['A']=df['A'].apply(str.upper)

In [71]:
df

       Price  Seqno Symbol        time  A
0     1623.0    0.0   APPL  1473411962  A
1     1623.0    0.0   APPL  1473411962  A
2     1623.0    0.0   APPL  1473411963  A
3     1623.0    0.0   APPL  1473411963  A
4     1649.0    1.0   APPL  1473411963  A
...      ...    ...    ...         ... ..
3984  1680.0  998.0   APPL  1473412961  A
3985  1509.0  999.0   APPL  1473412961  A
3986  1509.0  999.0   APPL  1473412961  A
3987  1509.0  999.0   APPL  1473412961  A
3988  1509.0  999.0   APPL  1473412962  A

[3989 rows x 5 columns]

In [72]:
ls ../bananaiselite/

AMZN.csv                               Public/
Anaconda/                              PycharmProjects/
Applications/                          VirtualBox VMs/
BABA.csv                               apply_demo.csv
Basic Pandas.ipynb                     bin/
DataFrame - Selecting and Index.ipynb  city_weather.csv
Desktop/                               demo_duplicate.csv
Documents/                             eclipse/
Downloads/                             eclipse-workspace/
Library/                               iris.csv
MEGA/                                  movie_metadata.csv*
MEGAsync Downloads/                    opt/
Movies/                                sales-funnel.xlsx
Music/                                 top5.csv
Parallels/                             train.csv
Pictures/                              usa_flights.csv
Pokemon.csv*

In [73]:
df = pd.read_csv('../bananaiselite/apply_demo.csv')

In [74]:
df

            time                                  data
0     1473411962     Symbol: APPL Seqno: 0 Price: 1623
1     1473411962     Symbol: APPL Seqno: 0 Price: 1623
2     1473411963     Symbol: APPL Seqno: 0 Price: 1623
3     1473411963     Symbol: APPL Seqno: 0 Price: 1623
4     1473411963     Symbol: APPL Seqno: 1 Price: 1649
...          ...                                   ...
3984  1473412961   Symbol: APPL Seqno: 998 Price: 1680
3985  1473412961   Symbol: APPL Seqno: 999 Price: 1509
3986  1473412961   Symbol: APPL Seqno: 999 Price: 1509
3987  1473412961   Symbol: APPL Seqno: 999 Price: 1509
3988  1473412962   Symbol: APPL Seqno: 999 Price: 1509

[3989 rows x 2 columns]

In [77]:
tmp = df['data'][0].strip().split(' ')

In [78]:
tmp[1],tmp[3],tmp[5]

('APPL', '0', '1623')

In [83]:
def foo(line):
    line = line.strip().split(' ')
    return Series([line[1],line[3],line[5]])

In [85]:
df_tmp = df['data'].apply(foo)

In [92]:
df_tmp.rename(columns={0:'symbol', 1:'sequo',2:'Price'})

     symbol sequo Price
0      APPL     0  1623
1      APPL     0  1623
2      APPL     0  1623
3      APPL     0  1623
4      APPL     1  1649
...     ...   ...   ...
3984   APPL   998  1680
3985   APPL   999  1509
3986   APPL   999  1509
3987   APPL   999  1509
3988   APPL   999  1509

[3989 rows x 3 columns]

In [94]:
df_tmp= df_tmp.rename(columns={0:'symbol', 1:'sequo',2:'Price'})

In [96]:
df_tmp.head()

  symbol sequo Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [97]:
df.combine_first(df_tmp)

     Price                                  data sequo symbol        time
0     1623     Symbol: APPL Seqno: 0 Price: 1623     0   APPL  1473411962
1     1623     Symbol: APPL Seqno: 0 Price: 1623     0   APPL  1473411962
2     1623     Symbol: APPL Seqno: 0 Price: 1623     0   APPL  1473411963
3     1623     Symbol: APPL Seqno: 0 Price: 1623     0   APPL  1473411963
4     1649     Symbol: APPL Seqno: 1 Price: 1649     1   APPL  1473411963
...    ...                                   ...   ...    ...         ...
3984  1680   Symbol: APPL Seqno: 998 Price: 1680   998   APPL  1473412961
3985  1509   Symbol: APPL Seqno: 999 Price: 1509   999   APPL  1473412961
3986  1509   Symbol: APPL Seqno: 999 Price: 1509   999   APPL  1473412961
3987  1509   Symbol: APPL Seqno: 999 Price: 1509   999   APPL  1473412961
3988  1509   Symbol: APPL Seqno: 999 Price: 1509   999   APPL  1473412962

[3989 rows x 5 columns]

In [98]:
df_new = df.combine_first(df_tmp)

In [99]:
del df_new['data']

In [100]:
df_new

     Price sequo symbol        time
0     1623     0   APPL  1473411962
1     1623     0   APPL  1473411962
2     1623     0   APPL  1473411963
3     1623     0   APPL  1473411963
4     1649     1   APPL  1473411963
...    ...   ...    ...         ...
3984  1680   998   APPL  1473412961
3985  1509   999   APPL  1473412961
3986  1509   999   APPL  1473412961
3987  1509   999   APPL  1473412961
3988  1509   999   APPL  1473412962

[3989 rows x 4 columns]

# clean duplicate

In [104]:
df = pd.read_csv('../bananaiselite/demo_duplicate.csv')

In [105]:
df.shape

(3989, 4)

In [107]:
df.head(10)

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963
5  1649.0    1.0   APPL  1473411963
6  1649.0    1.0   APPL  1473411964
7  1649.0    1.0   APPL  1473411964
8  1642.0    2.0   APPL  1473411964
9  1642.0    2.0   APPL  1473411964

In [109]:
len(df['Seqno'].unique())

1000

In [110]:
df['Seqno'].duplicated()

0       False
1        True
2        True
3        True
4       False
        ...
3984     True
3985    False
3986     True
3987     True
3988     True
Name: Seqno, Length: 3989, dtype: bool

In [111]:
df.drop_duplicates(['Seqno'])

       Price  Seqno Symbol        time
0     1623.0    0.0   APPL  1473411962
4     1649.0    1.0   APPL  1473411963
8     1642.0    2.0   APPL  1473411964
12    1636.0    3.0   APPL  1473411965
16    1669.0    4.0   APPL  1473411966
...      ...    ...    ...         ...
3969  1641.0  995.0   APPL  1473412957
3973  1581.0  996.0   APPL  1473412958
3977  1674.0  997.0   APPL  1473412959
3981  1680.0  998.0   APPL  1473412960
3985  1509.0  999.0   APPL  1473412961

[1000 rows x 4 columns]

# Time Series-Basic

In [113]:
import datetime

In [115]:
t = datetime.datetime(2016,9,10)
t

datetime.datetime(2016, 9, 10, 0, 0)

In [117]:
t_list={
    datetime.datetime(2016,9,20),
    datetime.datetime(2016,10,20),
    datetime.datetime(2016,10,22),
    datetime.datetime(2017,9,20),
    datetime.datetime(2017,10,20)
}

In [118]:
s1 = Series(np.random.rand(5),index = t_list)

In [119]:
s1

2016-10-20    0.714874
2017-10-20    0.024445
2017-09-20    0.621234
2016-10-22    0.855753
2016-09-20    0.628316
dtype: float64

In [120]:
s1['2016-10-20']

2016-10-20    0.714874
dtype: float64

In [121]:
s1['2016']

2016-10-20    0.714874
2016-10-22    0.855753
2016-09-20    0.628316
dtype: float64

In [122]:
s1['2016-10']

2016-10-20    0.714874
2016-10-22    0.855753
dtype: float64

In [123]:
s1[0]

0.7148744407855113

In [124]:
t = pd.date_range(start ='2017-01-01',end ='2017-02-01')

In [125]:
t

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11', '2017-01-12',
               '2017-01-13', '2017-01-14', '2017-01-15', '2017-01-16',
               '2017-01-17', '2017-01-18', '2017-01-19', '2017-01-20',
               '2017-01-21', '2017-01-22', '2017-01-23', '2017-01-24',
               '2017-01-25', '2017-01-26', '2017-01-27', '2017-01-28',
               '2017-01-29', '2017-01-30', '2017-01-31', '2017-02-01'],
              dtype='datetime64[ns]', freq='D')

In [129]:
t = pd.date_range(start ='2017-01-01',end ='2017-02-01', freq ='W')
t

DatetimeIndex(['2017-01-01', '2017-01-08', '2017-01-15', '2017-01-22',
               '2017-01-29'],
              dtype='datetime64[ns]', freq='W-SUN')

In [131]:
t = pd.date_range(start ='2017-01-01',end ='2017-02-01', periods =10)
t

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-04 10:40:00',
               '2017-01-07 21:20:00', '2017-01-11 08:00:00',
               '2017-01-14 18:40:00', '2017-01-18 05:20:00',
               '2017-01-21 16:00:00', '2017-01-25 02:40:00',
               '2017-01-28 13:20:00', '2017-02-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [132]:
s2 =Series(np.random.rand(100), index= pd.date_range(start ='2017-01-01', periods =100))

In [133]:
s2

2017-01-01    0.478140
2017-01-02    0.029085
2017-01-03    0.400283
2017-01-04    0.569750
2017-01-05    0.732363
                ...
2017-04-06    0.569886
2017-04-07    0.010047
2017-04-08    0.222892
2017-04-09    0.686213
2017-04-10    0.989435
Freq: D, Length: 100, dtype: float64

# Time Series- sample and plot

In [135]:
t_range = pd.date_range(start ='2016-01-01', end='2016-12-31')

In [136]:
t_range

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10',
               ...
               '2016-12-22', '2016-12-23', '2016-12-24', '2016-12-25',
               '2016-12-26', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2016-12-31'],
              dtype='datetime64[ns]', length=366, freq='D')

In [140]:
a = Series(np.random.rand(len(t_range)), index = t_range)

In [141]:
a

2016-01-01    0.134574
2016-01-02    0.668824
2016-01-03    0.344197
2016-01-04    0.643274
2016-01-05    0.951993
                ...
2016-12-27    0.122247
2016-12-28    0.855731
2016-12-29    0.430262
2016-12-30    0.436550
2016-12-31    0.637059
Freq: D, Length: 366, dtype: float64

In [142]:
a['2016-01']

2016-01-01    0.134574
2016-01-02    0.668824
2016-01-03    0.344197
2016-01-04    0.643274
2016-01-05    0.951993
2016-01-06    0.986263
2016-01-07    0.545776
2016-01-08    0.404704
2016-01-09    0.641710
2016-01-10    0.935690
2016-01-11    0.832368
2016-01-12    0.475367
2016-01-13    0.777481
2016-01-14    0.369491
2016-01-15    0.730082
2016-01-16    0.987177
2016-01-17    0.886183
2016-01-18    0.479509
2016-01-19    0.846519
2016-01-20    0.782839
2016-01-21    0.195698
2016-01-22    0.493704
2016-01-23    0.687611
2016-01-24    0.530587
2016-01-25    0.678705
2016-01-26    0.655170
2016-01-27    0.870851
2016-01-28    0.568908
2016-01-29    0.602359
2016-01-30    0.330784
2016-01-31    0.347201
Freq: D, dtype: float64

In [143]:
a['2016-01'].mean()

0.6253419125831129

In [146]:
a_month = a.resample('M').mean()

In [147]:
a_month

2016-01-31    0.625342
2016-02-29    0.511668
2016-03-31    0.534370
2016-04-30    0.564097
2016-05-31    0.540081
2016-06-30    0.516511
2016-07-31    0.570003
2016-08-31    0.502186
2016-09-30    0.408175
2016-10-31    0.403729
2016-11-30    0.403406
2016-12-31    0.412643
Freq: M, dtype: float64